docs/assign06.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2021-07-07 Wed 14:18 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>SWE 619 Assignment 6</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="ThanhVu (Vu) Nguyen" />
<link rel="stylesheet" href="https://nguyenthanhvuh.github.io/files/org.css">
</head>
<body>
<div id="content">
<h1 class="title">SWE 619 Assignment 6</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org2d8a0cd">1. Goals: Type Abstraction</a></li>
<li><a href="#orgaa4b753">2. Grading Criteria</a></li>
<li><a href="#org34ebb45">3. Links</a></li>
</ul>
</div>
</div>

<div id="outline-container-org2d8a0cd" class="outline-2">
<h2 id="org2d8a0cd"><span class="section-number-2">1</span> Goals: Type Abstraction</h2>
<div class="outline-text-2" id="text-1">
<p>
Consider the following <code>Market</code> class.
</p>

<div class="org-src-container">
<pre class="src src-java">
<span style="color: #859900; font-weight: bold;">class</span> <span style="color: #b58900; font-style: italic;">Market</span> {
   <span style="color: #859900; font-weight: bold;">private</span> <span style="color: #b58900; font-style: italic;">Set</span>&lt;<span style="color: #b58900; font-style: italic;">Item</span>&gt; <span style="color: #268bd2;">wanted</span>;           <span style="color: #96A7A9; font-style: italic;">// </span><span style="color: #96A7A9; font-style: italic;">items for which prices are of interest</span>
   <span style="color: #859900; font-weight: bold;">private</span> <span style="color: #b58900; font-style: italic;">Bag</span>&lt;<span style="color: #b58900; font-style: italic;">Item</span>, <span style="color: #b58900; font-style: italic;">Money</span>&gt; <span style="color: #268bd2;">offers</span>;    <span style="color: #96A7A9; font-style: italic;">// </span><span style="color: #96A7A9; font-style: italic;">offers to sell items at specific prices</span>
   <span style="color: #96A7A9; font-style: italic;">// </span><span style="color: #96A7A9; font-style: italic;">Note:  Bag isn't a Java data type.  Here, the bag entries are pairs.</span>

   <span style="color: #859900; font-weight: bold;">public</span> <span style="color: #b58900; font-style: italic;">void</span> <span style="color: #b58900;">offer</span> (<span style="color: #b58900; font-style: italic;">Item</span> <span style="color: #268bd2;">item</span>, <span style="color: #b58900; font-style: italic;">Money</span> <span style="color: #268bd2;">price</span>)
      <span style="color: #96A7A9; font-style: italic;">// </span><span style="color: #96A7A9; font-style: italic;">Requires: item is an element of wanted</span>
      <span style="color: #96A7A9; font-style: italic;">// </span><span style="color: #96A7A9; font-style: italic;">Effects:  add (item, price) to offers</span>

   <span style="color: #859900; font-weight: bold;">public</span> Money buy(<span style="color: #b58900; font-style: italic;">Item</span> <span style="color: #268bd2;">item</span>)
      <span style="color: #96A7A9; font-style: italic;">// </span><span style="color: #96A7A9; font-style: italic;">Requires: item is an element of the domain of offers</span>
      <span style="color: #96A7A9; font-style: italic;">// </span><span style="color: #96A7A9; font-style: italic;">Effects: choose and remove some (arbitrary) pair (item, price) from</span>
      <span style="color: #96A7A9; font-style: italic;">//          </span><span style="color: #96A7A9; font-style: italic;">offers and return the chosen price</span>
}

</pre>
</div>

<ol class="org-ol">
<li><p>
Suppose that offers are only accepted if they are lower than previous offers.
</p>
<div class="org-src-container">
<pre class="src src-java"><span style="color: #859900; font-weight: bold;">class</span> <span style="color: #b58900; font-style: italic;">Low_Bid_Market</span> <span style="color: #859900; font-weight: bold;">extends</span> <span style="color: #b58900; font-style: italic;">Market</span> {
   <span style="color: #859900; font-weight: bold;">public</span> <span style="color: #b58900; font-style: italic;">void</span> <span style="color: #b58900;">offer</span> (<span style="color: #b58900; font-style: italic;">Item</span> <span style="color: #268bd2;">item</span>, <span style="color: #b58900; font-style: italic;">Money</span> <span style="color: #268bd2;">price</span>)
      <span style="color: #96A7A9; font-style: italic;">// </span><span style="color: #96A7A9; font-style: italic;">Requires: item is an element of wanted</span>
      <span style="color: #96A7A9; font-style: italic;">// </span><span style="color: #96A7A9; font-style: italic;">Effects:  if (item, price) is not cheaper than any existing pair</span>
      <span style="color: #96A7A9; font-style: italic;">//           </span><span style="color: #96A7A9; font-style: italic;">(item, existing_price) in offers do nothing</span>
      <span style="color: #96A7A9; font-style: italic;">//           </span><span style="color: #96A7A9; font-style: italic;">else add (item, price) to offers</span>

</pre>
</div>
<p>
Is <code>Low_Bid_Market</code> a valid subtype of <code>Market</code>? Appeal to the methods rule to back up your answer.
</p></li>

<li><p>
Suppose that the buy() method always chooses the lowest price on an item.
</p>
<div class="org-src-container">
<pre class="src src-java"><span style="color: #859900; font-weight: bold;">class</span> <span style="color: #b58900; font-style: italic;">Low_Offer_Market</span> <span style="color: #859900; font-weight: bold;">extends</span> <span style="color: #b58900; font-style: italic;">Market</span> {
       <span style="color: #859900; font-weight: bold;">public</span> <span style="color: #b58900; font-style: italic;">Money</span> <span style="color: #b58900;">buy</span>(<span style="color: #b58900; font-style: italic;">Item</span> <span style="color: #268bd2;">item</span>)
          <span style="color: #96A7A9; font-style: italic;">// </span><span style="color: #96A7A9; font-style: italic;">Requires: item is an element the domain of offers</span>
          <span style="color: #96A7A9; font-style: italic;">// </span><span style="color: #96A7A9; font-style: italic;">Effects: choose and remove pair (item, price) with the </span>
          <span style="color: #96A7A9; font-style: italic;">//          </span><span style="color: #96A7A9; font-style: italic;">lowest price from offers and return the chosen price</span>
</pre>
</div>
<p>
Is <code>Low_Offer_Market</code> a valid subtype of <code>Market</code>? Appeal to the methods rule to back up your answer. 
</p></li>
</ol>
</div>
</div>




<div id="outline-container-orgaa4b753" class="outline-2">
<h2 id="orgaa4b753"><span class="section-number-2">2</span> Grading Criteria</h2>
<div class="outline-text-2" id="text-2">
<p>
This is purely a "paper and pencil" exercise. No code is required. Write your answer so that it is easily understandable by someone with only a passing knowledge of Liskov's rules for subtypes.
</p>
</div>
</div>


<div id="outline-container-org34ebb45" class="outline-2">
<h2 id="org34ebb45"><span class="section-number-2">3</span> Links</h2>
<div class="outline-text-2" id="text-3">
<ul class="org-ul">
<li><a href="./index.html">Syllabus</a></li>
<li><a href="./schedule.html">Schedule</a></li>
</ul>
</div>
</div>
</div>
</body>
</html>
